# Создать образ на основе базового слоя python (там будет ОС и интерпретатор Python).
# 3.9 — используемая версия Python.
# slim — обозначение того, что образ имеет только необходимые компоненты для запуска,
# он не будет занимать много места при развёртывании.
FROM python:3.9-slim

# Запустить команду создания директории внутри контейнера
RUN mkdir /app

# Установить рабочую директорию
WORKDIR /app

# Скопировать с локального компьютера файл зависимостей
# в директорию /app.
COPY requirements.txt /app/

# Выполнить установку зависимостей внутри контейнера.
RUN pip install --no-cache-dir -r requirements.txt

# Скопировать содержимое директории notekeeper с локального компьютера
# в директорию /app.
COPY notekeeper/ /app/

# Выполнить запуск сервера разработки при старте контейнера.
CMD ["python", "manage.py", "runserver", "0.0.0.0:8000"]